
    {
        "text":"This INVESTMENT MANAGEMENT AGREEMENT, made as of the 27th day of July, 2015, by and between T. ROWE PRICE RETIREMENT FUNDS, INC. (the “Corporation”), a corporation organized and existing under the laws of the State of Maryland, and T. ROWE PRICE ASSOCIATES, INC. (the “Manager”), a corporation organized and existing under the laws of the State of Maryland. W I T N E S S E T H:  WHEREAS, the Corporation is engaged in business as an open-end management investment company and is registered as such under the federal Investment Company Act of 1940, as amended (the “Act”); and  WHEREAS, the Corporation is authorized to issue shares of capital stock (“Shares”) in the T. Rowe Price Retirement I 2050 Fund—I Class (the “Fund”), a separate series of the Corporation whose Shares represent interests in a separate portfolio of securities and other assets (“Fund Shares”); and  WHEREAS, the Manager is engaged principally in the business of rendering investment supervisory services and is registered with the U.S. Securities and Exchange Commission as an investment adviser under the Investment Advisers Act of 1940, as amended; and  WHEREAS, the Fund desires the Manager to render investment supervisory services to the Fund in the manner and on the terms and conditions hereinafter set forth;  NOW, THEREFORE, in consideration of the premises and the mutual promises hereinafter set forth, the parties hereto agree as follows:  1. Duties and Responsibilities of Manager.   A. Investment Management Services. The Manager shall act as investment manager and shall supervise and direct the investments of the Fund in accordance with the Fund’s investment objective, program, and restrictions as provided in the Corporation’s prospectus, on behalf of the Fund, as amended from time to time, and such other limitations as the Fund may impose by notice in writing to the Manager. The Manager shall obtain and evaluate such information relating to the economy, industries, businesses, securities markets, and securities as it may deem necessary or useful in the discharge of its obligations hereunder and shall formulate and implement a continuing program for the management of the assets and resources of the Fund in a manner consistent with its investment objective. In furtherance of this duty, the Manager, as agent and attorney-in-fact with respect to the Corporation, is authorized, in its discretion and without prior consultation with the Corporation, to:    (i) buy, sell, exchange, convert, and otherwise trade in any stocks, bonds, and other securities or assets;    (ii) place orders and negotiate the commissions (if any) for the execution of transactions in securities with or through such brokers, dealers, underwriters, or issuers as the Manager may select; and    (iii) vote proxies, exercise conversion or subscription rights, and respond to tender offers and other consent solicitations with respect to the securities in which the Fund’s assets may be invested provided such materials have been forwarded to the Manager in a timely fashion by the Corporation’s custodian.   B. Financial, Accounting, and Administrative Services. The Manager shall maintain the existence and records of the Corporation; maintain the registrations and qualifications of Fund shares under federal and state law; monitor the financial, accounting, and administrative functions of the Fund; maintain liaison with the various agents employed for the benefit of the Fund by the Corporation (including the Corporation’s transfer agent, custodian, independent accountants, and legal counsel) and assist in the coordination of their activities on behalf of the Fund.   C. Reports to Fund. The Manager shall furnish to or place at the disposal of the Corporation or Fund, as appropriate, such information, reports, evaluations, analyses, and opinions as they may, at any time or from time to time, reasonably request or as the Manager may deem helpful to the Fund.   D. Reports and Other Communications to Fund Shareholders. The Manager shall assist in developing all general shareholder communications, including regular shareholder reports.   E. Fund Personnel. The Manager agrees to permit individuals who are officers or employees of the Manager to serve (if duly elected or appointed) as officers, directors, members of any committee of directors, members of any advisory board, or members of any other committee of the Corporation or Fund, without remuneration or other cost to the Fund or the Corporation.   F. Personnel, Office Space, and Facilities of Manager. The Manager at its own expense shall furnish or provide and pay the cost of such office space, office equipment, office personnel, and office services as the Manager requires in the performance of its investment advisory and other obligations under this Agreement."
    }  
